In [2]:
#read excel file into pandas dataframe
df=pd.read_csv(r'C:\Users\Mary\Desktop\Python programs\Book2.csv')
df

   ST_NUM     ST_NAME NUM_BEDROOM OWN_OCCUPIED
0   104.0  WASHINGTON           3            Y
1   197.0   LEXINGTON           3            N
2     NaN   LEXINGTON         NaN            N
3   201.0    BERKELEY           1           12
4   203.0    BERKELEY           3            Y
5   207.0    BERKELEY         NaN            Y
6     NaN  WASHINGTON           2          NaN
7   213.0     TREMONT           4            Y
8   215.0     TREMONT          na            Y

In [3]:
#import libraries
import numpy as np
import pandas as pd
missing_values=['na']

In [4]:
print(df['ST_NUM'])

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [5]:
print(df['ST_NUM'].isnull())

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [6]:
df

   ST_NUM     ST_NAME NUM_BEDROOM OWN_OCCUPIED
0   104.0  WASHINGTON           3            Y
1   197.0   LEXINGTON           3            N
2     NaN   LEXINGTON         NaN            N
3   201.0    BERKELEY           1           12
4   203.0    BERKELEY           3            Y
5   207.0    BERKELEY         NaN            Y
6     NaN  WASHINGTON           2          NaN
7   213.0     TREMONT           4            Y
8   215.0     TREMONT          na            Y

In [7]:
df['NUM_BEDROOM'].isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOM, dtype: bool

In [8]:
df.isnull().sum()

ST_NUM          2
ST_NAME         0
NUM_BEDROOM     2
OWN_OCCUPIED    1
dtype: int64

In [9]:
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [10]:
df

   ST_NUM     ST_NAME NUM_BEDROOM OWN_OCCUPIED
0   104.0  WASHINGTON           3            Y
1   197.0   LEXINGTON           3            N
2     NaN   LEXINGTON         NaN            N
3   201.0    BERKELEY           1           12
4   203.0    BERKELEY           3            Y
5   207.0    BERKELEY         NaN            Y
6     NaN  WASHINGTON           2          NaN
7   213.0     TREMONT           4            Y
8   215.0     TREMONT          na            Y

In [11]:
#Detecting missing values in own occupied column

cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int (row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan 
    except ValueError:
            pass
    cnt+=1

In [12]:
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [13]:
df.isnull().values.any()    #checking if there is any missing value

True

In [14]:
# One of the methods of cleaning data by filling the empty spaces
df.fillna(method = 'ffill', inplace=True)

In [15]:
df.isnull().values.any()

False

In [16]:
df

   ST_NUM     ST_NAME NUM_BEDROOM OWN_OCCUPIED
0   104.0  WASHINGTON           3            Y
1   197.0   LEXINGTON           3            N
2   197.0   LEXINGTON           3            N
3   201.0    BERKELEY           1            N
4   203.0    BERKELEY           3            Y
5   207.0    BERKELEY           3            Y
6   207.0  WASHINGTON           2            Y
7   213.0     TREMONT           4            Y
8   215.0     TREMONT          na            Y

In [19]:
df.isnull().values.any()

False